// Строгий режим
"use strict"


//Задача №1 
//Що потрапить в консоль?
/*let someVar = 0;
++someVar;
if (someVar) {
	console.log(someVar);
}*/

//Ответ: В консоль попадет 1 (++увеличивает значение на 1)
//=======================================================

/*Задача №2
За допомогою циклу FOR виведіть в консоль 10 рядків:
Пункт №1
Пункт №2
і т.д.*/

/*for (let i = 1; i < 11; ++i) {	
	console.log(`Пункт №"${i}`);
}*/
//Создаем переменную i со значением от 1 до 11 (не более 11)
//Добавляем переменную i к тексту
//Выводится 10 строк:
//Пункт №1
//Пункт №2
//Пункт №3
//Пункт №4
//Пункт №5
//Пункт №6
//Пункт №7
//Пункт №8
//Пункт №9
//Пункт №10
//=======================================================
//Задача №3
//Що потрапить в консоль ?
/*if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
	console.log('000');
}*/

if (false || false && true || false) {
}

if (false || false || false) {
}

//Ответ: В консоль ничего не попадет

//==================================================

/*Задача №4
Створіть функцію, яка повертає результат ділення числа a на число b з додаванням рядка "Результат ділення: "
Викличте функцію передаючі різні значення, у тому числі не передаючи зовсім.
Функція не має повертати NaN, Infinite або помилку */

//Функция деления чисел
/*function calcDiv(a = 0, b = 0) {
	return a / b
}
//Функция возврата разных значений
function showMessage(someText = "Я текст по умолчанию"){
console.log(someText);
}*/
//showMessage(`Результат  ділення: ${calcDiv(320, 40)}`)
//В консоль выводится: Результат  ділення: 8

//showMessage(`Результат  ділення: ${calcDiv(1230, 15)}`)
//В консоль выводится: Результат  ділення: 82

//showMessage(`Результат  ділення: ${calcDiv("3", "3")}`)
//В консоль выводится: Результат  ділення: 1

//showMessage(`Результат  ділення: ${calcDiv(0, "3")}`)
//В консоль выводится: Результат  ділення: 0

//showMessage(`Результат  ділення: ${calcDiv(0, 5)}`)
//В консоль выводится: Результат  ділення: 0

//showMessage(35)
//В консоль выводится: 35

//showMessage("Привет!")
//В консоль выводится: Привет!

//showMessage()
//В консоль выводится текст по умолчанию - Я текст по умолчанию"

//===================================================

/*Задача №5
Створіть масив даних - 5 елементів, один з яких число 10
Обробіть масив за допомогою методу перебору
Перевіряйте елемент на відповідність числу 10, та у разі відповідності, виводьте в консоль*/

/*let someArray = [7, "Привіт!", false, 10, 15];
someArray.forEach((value) => {	
	if (value === 10) {		
		console.log(value);	
	}
});*/
//Создаем условие если есть значение равное 10, то выводим в консоль



